Revit 2027 API
SelectionUIOptions.SelectLinks Property
 Indicates whether Revit and CAD link instances can be selected.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SelectLinks { get; set; }
Public Property SelectLinks As Boolean
	Get
	Set
public:
property bool SelectLinks {
	bool get ();
	void set (bool value);
}
member SelectLinks : bool with get, set
Property Value
Boolean
Remarks
 When this setting is false, users cannot directly select link instances or elements within them in the canvas. This makes it easy for the user to avoid accidentally selecting and moving links. When this setting is true, users can select link instances.
See Also
Reference
SelectionUIOptions Class
Autodesk.Revit.UI Namespace